pmo-dataset/variations/mermaid_with_ids/22.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["check case"]
	Task_2["send request for\npayment"]
	Task_3["close case"]
	Task_4["send reminder"]
	Task_5["check reasoning"]
	Task_6["close case"]
	Task_7["hand over to\ncollection agency"]
	Task_8["make booking"]
	Task_9["close case"]
	StartMessageEvent_1(("probable recourse\ndetected"))
	EndNoneEvent_1(("case closed")):::endEvent
	EndNoneEvent_2(("case closed")):::endEvent
	EndNoneEvent_3(("case open")):::endEvent
	EndNoneEvent_4(("case closed")):::endEvent
	IntermediateMessageEventCatching_1((("disagreement letter\nreceived")))
	IntermediateTimerEvent_1((("Reminder is due")))
	IntermediateMessageEventCatching_2((("Money received")))
	ExclusiveGateway_1{"recourse possible?"}
	ExclusiveGateway_2{"OK?"}
	EventBasedGateway_1{"E"}

	StartMessageEvent_1 --> Task_1
	Task_1 --> ExclusiveGateway_1
	ExclusiveGateway_1 -->|"yes"| Task_2
	ExclusiveGateway_1 -->|"no"| Task_3
	Task_3 --> EndNoneEvent_1
	Task_2 --> Task_4
	Task_4 --> EventBasedGateway_1
	EventBasedGateway_1 --> IntermediateMessageEventCatching_1
	IntermediateMessageEventCatching_1 --> Task_5
	Task_5 --> ExclusiveGateway_2
	ExclusiveGateway_2 -->|"yes"| Task_6
	Task_6 --> EndNoneEvent_2
	EventBasedGateway_1 --> IntermediateTimerEvent_1
	IntermediateTimerEvent_1 --> Task_7
	ExclusiveGateway_2 -->|"no"| Task_7
	Task_7 --> EndNoneEvent_3
	EventBasedGateway_1 --> IntermediateMessageEventCatching_2
	IntermediateMessageEventCatching_2 --> Task_8
	Task_8 --> Task_9
	Task_9 --> EndNoneEvent_4

	subgraph Pool_1 ["Recourse Clerk"]
	  Task_1
	  Task_2
	  Task_3
	  Task_4
	  Task_5
	  Task_6
	  Task_7
	  Task_8
	  Task_9
	  StartMessageEvent_1
	  EndNoneEvent_1
	  EndNoneEvent_2
	  EndNoneEvent_3
	  EndNoneEvent_4
	  IntermediateMessageEventCatching_1
	  IntermediateTimerEvent_1
	  IntermediateMessageEventCatching_2
	  ExclusiveGateway_1
	  ExclusiveGateway_2
	  EventBasedGateway_1
	end
